Tekla.Structures.Catalogs.UserPropertyItem.GetOptions(System.Collections.Generic.List{System.Collections.Generic.KeyValuePair{System.Int32,System.String}}@)
Gets the value options of an integer property. Option strings are translated when translation is available.
IntOptions: The value options that were gotten.
Returns:
True on success.

Tekla.Structures.Catalogs.UserPropertyItem.GetOptions(System.Collections.Generic.List{System.Collections.Generic.KeyValuePair{System.Int32,System.String}}@,System.Boolean)
Gets the value options of an integer property.
IntOptions: The value options that were gotten.
translatedLabels: if set to true labels translated to current language are returned, otherwise the resource key of label is returned.
Returns:
True on success.

Tekla.Structures.Catalogs.UserPropertyItem.GetOptions(System.Collections.Generic.List{System.Collections.Generic.KeyValuePair{System.Double,System.String}}@)
Gets the value options of a double property. Option strings are translated when translation is available.
DoubleOptions: The value options that were gotten.
Returns: True on success.

Tekla.Structures.Catalogs.UserPropertyItem.GetOptions(System.Collections.Generic.List{System.Collections.Generic.KeyValuePair{System.Double,System.String}}@,System.Boolean)
Gets the value options of a double property.
DoubleOptions: The value options that were gotten.
translatedLabels: if set to true labels translated to current language are returned, otherwise the resource key of label is returned.
Returns: True on success.

Tekla.Structures.Catalogs.UserPropertyItem.GetOptions(System.Collections.Generic.List{System.Collections.Generic.KeyValuePair{System.String,System.String}}@)
Gets the value options of a string property. Option strings are translated when translation is available.
StringOptions: The value options that were gotten.
Returns: True on success.

Tekla.Structures.Catalogs.UserPropertyItem.GetOptions(System.Collections.Generic.List{System.Collections.Generic.KeyValuePair{System.String,System.String}}@,System.Boolean)
Gets the value options of a string property.
StringOptions: The value options that were gotten.
translatedLabels: if set to true labels translated to current language are returned, otherwise the resource key of label is returned.
Returns: True on success.